---
kind: type
id: T:Autodesk.Revit.UI.IExternalCommandAvailability
source: html/c05acaf4-4cd9-8fd6-db06-44b22ae4f987.htm
---
# Autodesk.Revit.UI.IExternalCommandAvailability

An interface that should be implemented to provide the implementation for a accessibility check for a Revit add-in External Command.

## Syntax (C#)
```csharp
public interface IExternalCommandAvailability
```

## Remarks
This interface should share the same assembly with add-in External Command.